tap "coursier/formulas"
tap "exolnet/deprecated"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "liamg/tfsec"
tap "olafurpg/scalafmt"
tap "warrensbox/tap"
cask "adoptopenjdk8"
cask "osxfuse"
brew "ack"
brew "ammonite-repl"
brew "antigen"
brew "autoconf"
brew "automake"
brew "gettext"
brew "readline"
brew "awscli"
brew "bash"
brew "boost"
brew "cmake"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "exa"
brew "fd"
brew "flac"
brew "libtool"
brew "libsndfile"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "flyway"
brew "fortune"
brew "unixodbc"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "glew"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphicsmagick"
brew "hello"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "libicns"
brew "libmagic"
brew "librsvg"
brew "libxslt"
brew "libyaml"
brew "lolcat"
brew "mariadb"
brew "minikube"
brew "neovim"
brew "nvm"
brew "physfs"
brew "postgresql"
brew "pre-commit"
brew "pwgen"
brew "ruby", link: true
brew "s3cmd"
brew "sbt"
brew "scala"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sshfs"
brew "telnet"
brew "terraform-docs"
brew "terraform_landscape"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "tor"
brew "torsocks"
brew "unzip"
brew "vorbis-tools"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "yarn"
brew "zsh"
brew "coursier/formulas/coursier"
brew "exolnet/deprecated/php@5.6", link: true
brew "exolnet/deprecated/php@7.1"
brew "liamg/tfsec/tfsec"
brew "warrensbox/tap/tfswitch"
cask "1password-cli"
cask "aerial"
cask "android-platform-tools"
cask "google-chrome"
cask "ngrok"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "sfdx"
cask "slack"
cask "tunnelblick"
cask "vlc"
