tap "aws/tap"
tap "common-fate/granted"
tap "coursier/formulas"
tap "datawire/blackbird"
tap "exolnet/deprecated"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kreuzwerker/taps"
tap "liamg/tfsec"
tap "olafurpg/scalafmt"
tap "shivammathur/php"
tap "virtuslab/scala-cli"
tap "warrensbox/tap"
tap "yurikoles/yurikoles"
brew "ack"
brew "act"
brew "gettext"
brew "openssl@3"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "ammonite-repl"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "unixodbc"
brew "asdf"
brew "awscli"
brew "bash"
brew "boost"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "php"
brew "composer"
brew "datamash"
brew "dockutil"
brew "fd"
brew "flac"
brew "libsndfile"
brew "pango"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "flyway"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "git-open"
brew "glew"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "gradle-completion"
brew "graphicsmagick"
brew "hello"
brew "howdoi"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "libicns"
brew "libmagic"
brew "librsvg"
brew "libxslt"
brew "lolcat"
brew "lsd"
brew "mariadb"
brew "maven"
brew "minikube"
brew "mkcert"
brew "moreutils"
brew "neovim"
brew "node"
brew "nvm"
brew "parquet-cli"
brew "perl"
brew "physfs"
brew "postgresql@14"
brew "pre-commit"
brew "pwgen"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "s3cmd"
brew "sbt"
brew "sdl2_image"
brew "sdl2_ttf"
brew "speedtest-cli"
brew "starship"
brew "telnet"
brew "terraform-docs"
brew "terraform_landscape"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "tor"
brew "torsocks"
brew "tree"
brew "uncrustify"
brew "unzip"
brew "vim"
brew "vorbis-tools"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "yarn"
brew "zsh"
brew "aws/tap/copilot-cli"
brew "common-fate/granted/granted"
brew "coursier/formulas/coursier"
brew "datawire/blackbird/telepresence"
brew "hashicorp/tap/terraform", link: false
brew "kreuzwerker/taps/m1-terraform-provider-helper"
brew "shivammathur/php/php@5.6"
brew "virtuslab/scala-cli/scala-cli"
brew "warrensbox/tap/tfswitch"
cask "1password-cli"
cask "android-platform-tools"
cask "macfuse"
cask "ngrok"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "sf"
cask "visual-studio-code"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "dbaeumer.vscode-eslint"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dragos.scala-lsp"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "scala-lang.scala"
vscode "scala-lang.scala-snippets"
vscode "scalameta.metals"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
